In [2]:
import pandas as pd
import numpy as np

In [20]:
data = {
    'Category' : ['A', 'B', 'A', 'B', 'A', 'B', 'A', 'B'],
    'Store' : ['S1', 'S2', 'S1', 'S2', 'S1', 'S2', 'S2', 'S1'],
    'Sales' : [140, 150, 169, 160, 185, 200, 120, 169],
    'Quantity' : [10, 25,30, 39, 49, 50, 60, 76],
    'Date' : pd.date_range('2024-05-05',periods = 8)
}
df = pd.DataFrame(data)

In [21]:
df

  Category Store  Sales  Quantity       Date
0        A    S1    140        10 2024-05-05
1        B    S2    150        25 2024-05-06
2        A    S1    169        30 2024-05-07
3        B    S2    160        39 2024-05-08
4        A    S1    185        49 2024-05-09
5        B    S2    200        50 2024-05-10
6        A    S2    120        60 2024-05-11
7        B    S1    169        76 2024-05-12

In [22]:
# Group by category and Calculate the sum of sales
cat = df.groupby('Category')['Sales'].sum()
cat

Category
A    614
B    679
Name: Sales, dtype: int64

In [23]:
# Group n=by Stores and Calucate the sum of sales
cat = df.groupby('Store')['Sales'].sum()
cat

Store
S1    663
S2    630
Name: Sales, dtype: int64

In [25]:
# Group by multiple column
# Group by category and store
cat = df.groupby(['Category', 'Store'])['Sales'].sum()
cat

Category  Store
A         S1       494
          S2       120
B         S1       169
          S2       510
Name: Sales, dtype: int64

In [26]:
# Aggregation
# mean,meadian,mode,min.,max., count, std

In [27]:
df['Sales'].mean()

np.float64(161.625)

In [29]:
# Multiple Aggregation .agg()

In [34]:
df['Sales'].agg(['sum', 'mean', 'min', 'max', 'count', 'std', 'median'])

sum       1293.000000
mean       161.625000
min        120.000000
max        200.000000
count        8.000000
std         25.258308
median     164.500000
Name: Sales, dtype: float64